{
    "reviews": [
      {
        "authorLastName": "B.",
        "createdDate": {
          "month": 1,
          "year": 2018,
          "day": 12
        },
        "authorFirstName": "Safiya",
        "rating": 5,
        "id": 3633506,
        "text": "Dr. Methani and her hygienist are AMAZING! They were so gentle with my four year old that he loved his experience and wants to play dentist everyday!  She filled his cavity without any unnecessary procedures (unlike other dentists who insists small children need to be put under general anesthesia just to fill a cavity!) and during the procedure he hardly flinched! Both me and him left with huge smiles on our faces! I was literally searching for a dentist like her for two years, I am so happy to have found her and my son and I will likely be her patient for life!",
        "title": "Filled my Four Year Old's Cavity in The Most Gentle and Caring Manner"
      },
      {
        "authorLastName": "Stupen",
        "createdDate": {
          "month": 8,
          "year": 2017,
          "day": 5
        },
        "authorFirstName": "Joan",
        "rating": 5,
        "id": 3329172,
        "text": "I visited Leaside Village Dental on Laird Drive for the first time and had an exceptionally good experience.  I needed an extraction and a three tooth bridge and Dr. Sohila Methani performed the procedure in a very competent, caring and pain free manner.  Dr. Sohila Methani is highly qualified and practices dentistry like I never experienced before.  I am absolutely delighted with the outcome and the exceptional care that I received.  Leaside Village Dental is my choice for the future.  Thank you , Dr. Methani for putting a bigger smile on my face.",
        "title": "Dentistry of the future"
      },
      {
        "authorLastName": "Des Rosiers",
        "createdDate": {
          "month": 4,
          "year": 2017,
          "day": 27
        },
        "authorFirstName": "David",
        "rating": 5,
        "id": 3106884,
        "text": "A friend highly recommended me to come here at Leaside Village Dental. The entire staff surpassed my expectations. Everyone from Dr. Methani to the hygienists and receptionists are so friendly and competent. They will accompany you every step of the way; from looking for your new insurance policy to the treatment, everything was easy and professional. Not only they will make you feel welcome, but I feel that their philosophy is to educate patients, with a smile. \n\nDavid",
        "title": "Professional and Friendly"
      },
      {
        "authorLastName": "Ott",
        "createdDate": {
          "month": 4,
          "year": 2017,
          "day": 12
        },
        "authorFirstName": "Markus",
        "rating": 5,
        "id": 3075736,
        "text": "Dr. Methani is a professional and knowledgeable dentist. She gives options and suits the needs of her patients. I did not feel the needle when I needed freezing. Dr Methani is very gentle and does excellent work. I recommend her to anyone looking for a new dentist.",
        "title": "By far the most high quality service, professional and friendly dentist!"
      },
      {
        "authorLastName": "P",
        "createdDate": {
          "month": 1,
          "year": 2017,
          "day": 8
        },
        "authorFirstName": "Jill",
        "rating": 5,
        "id": 2873033,
        "text": "I broke a filling on a Saturday, and was scheduled to leave on vacation early the next Monday. My dentist is not available Saturdays. I found Dr. Methani's website, called the office and within an hour and a half my tooth was being fixed. The staff and Dr. Methani were welcoming and skilled. My tooth is better than before and I was able to leave for my holiday on schedule. I am so grateful for Dr. Methani's help.",
        "title": "Emergency tooth repair"
      },
      {
        "authorLastName": "Doerr",
        "createdDate": {
          "month": 11,
          "year": 2016,
          "day": 1
        },
        "authorFirstName": "Donna",
        "rating": 5,
        "id": 2757040,
        "text": "Most caring Dentist we have ever encountered.  Takes her time - you never feel rushed.  She makes sure that you are comfortable and pain free.",
        "title": "Most Caring Dentist"
      },
      {
        "authorLastName": "Barrett",
        "createdDate": {
          "month": 4,
          "year": 2016,
          "day": 25
        },
        "authorFirstName": "Lisa",
        "rating": 5,
        "id": 2291014,
        "text": "All of my children are new patients to Dr. Methani.  Recently, my daughter who is very scared of needles needed a filling.  I can't say enough about Dr. Methani and all of her staff. They tried many different approaches and after a lengthy time dedicated to completing the procedure they were successful, much to my delight and my daughters. They went way beyond what was expected to make sure my daughter was as comfortable as possible. Thank you. I highly recommend Dr. Methani and her practise. State of the art facility, convenient with lots of free parking available.",
        "title": "Extremely gentle and patient!"
      },
      {
        "authorLastName": "Maredia",
        "createdDate": {
          "month": 11,
          "year": 2015,
          "day": 7
        },
        "authorFirstName": "Aziz",
        "rating": 5,
        "id": 1808770,
        "text": "Recently got treated by Dr. Methani for my cracked tooth which used to hurt a lot and I dint knew the cause of pain, which she identified and walked me through each and every step of the process and took me out of that pain successfully. The office is very clean and the entire team is very professional and helpfull. The experience was very comfortable and would \nrecommend her.",
        "title": "Highly Skilled Dentist"
      },
      {
        "authorLastName": "Fox",
        "createdDate": {
          "month": 7,
          "year": 2015,
          "day": 15
        },
        "authorFirstName": "Linda",
        "rating": 5,
        "id": 1495842,
        "text": "Had one of the best dental experiences in years with Dr. Methani at Leaside Village Dental. I never once felt like I was being pressured into having a whole lot of work done that was not needed. An experience I have had with other dental offices in the areas. She was wonderfully gentle but thorough with my cleaning (and I was a bit overdue because of a bad experience elsewhere in January). Her staff are all very young and the office is spotless. Dr. Methani has practiced for 16 years and her chairside manner is friendly yet direct. I have now found my new home for dental visits. Recommended highly.",
        "title": "Excellent experience"
      },
      {
        "authorLastName": "Karovalia",
        "createdDate": {
          "month": 4,
          "year": 2015,
          "day": 24
        },
        "authorFirstName": "Ali",
        "rating": 5,
        "id": 1288395,
        "text": "Located conveniently, Leaside Village Dental was the perfect place for me to go to. I had a great experience. The place was clean, neat and very welcoming. The dentists were highly qualified and very helpful in helping me understand the root cause of my problem and devised a treatment plan to make sure the treatment ran in a smooth and timely manner. I have already recommended Leaside Village Dental to my all friends and colleagues. It's the place to go for all your dental work!",
        "title": "Awesome!"
      },
      {
        "authorLastName": "Boertien",
        "createdDate": {
          "month": 4,
          "year": 2015,
          "day": 7
        },
        "authorFirstName": "Shana",
        "rating": 5,
        "id": 1239377,
        "text": "Dr. Methani is a really wonderful dentist and runs a great business. The office is small, intimate and immaculately clean! My husband and I both decided to give this place a shot as we were looking for a new dentist. After a few bad experiences in the past, my husband is very cautious and critical of most dentists but with Dr. Methani, she made him feel comfortable and he really likes coming here. We both appreciate how clean, accommodating, and professional the team here are--they take their time and make sure you are informed and comfortable with any procedures that are required.The weekend hours and late weekday hours are critical for us as our work schedules don't permit Mon-Fri 9-5 appointments, so her flexible hours are extremely convenient. I highly recommend this practice.",
        "title": "Wonderful Dentist Experience"
      },
      {
        "authorLastName": "S",
        "createdDate": {
          "month": 4,
          "year": 2015,
          "day": 2
        },
        "authorFirstName": "Steve",
        "rating": 5,
        "id": 1223208,
        "text": "My family and myself are patients of Dr. Methani for last 5 years since she was working at another clinic. What I like about her is that she is gentle, thorough, ethical (I've been to other dentists who find something to do at every visit) and passionate about her work. My kids love to see her too. It is a bit of a drive for me to her new location, but I think it is definitely worth it! I wish her good luck with her new office. I am sure she will do good.",
        "title": "Always been a good experience!"
      },
      {
        "authorLastName": "Maknojia",
        "createdDate": {
          "month": 3,
          "year": 2015,
          "day": 10
        },
        "authorFirstName": "Shiraz",
        "rating": 5,
        "id": 1158473,
        "text": "An ideal place for dental treatment for me and my family.  Cool experience..... best service I have ever been through till date.  Latest technology use and excellent hands made my RC treatment a smooth and comfortable experience.  I would suggest all my friends to consider choosing this place and see the difference.",
        "title": "Wow, truly majestic for same cost..."
      },
      {
        "authorLastName": "Raina",
        "createdDate": {
          "month": 3,
          "year": 2015,
          "day": 8
        },
        "authorFirstName": "S",
        "rating": 5,
        "id": 1151506,
        "text": "After a very bad job done by my previous dentist, I decided to try out Leaside Dental when i saw an advertisement.\nI was pleasantly surprised and very happy with the outcome of my crown that i got fixed here. I was surprised to learn that services i was recommended by my previous dentist were not really needed based on a total mouth assessment here. The technology used is top notch and very impressive.\nI would certainly recommend Leaside Dental for their very high level of professionalism.",
        "title": "Latest technology and very professional"
      },
      {
        "authorLastName": "Long",
        "createdDate": {
          "month": 3,
          "year": 2015,
          "day": 6
        },
        "authorFirstName": "Chesley",
        "rating": 5,
        "id": 1150543,
        "text": "I absolutely love going to the dentist and switching over to Leaside Village Dental was an easy choice. Very conveniently located to get other errands done and have the appointment accommodate my day. The office is overwhelmingly clean, and the biggest upside is the current technology they are using. Too often dental offices never upgrade their equipment, however here at Leaside Village Dental - everything is brand new. Cameras that go into the mouth so you can view on the screen what is actually happen. The proof is on the screen. With all the latest equipment the appointment was able to move along quite nicely. No interruptions. \nGreeted with a lovely smile and processing my insurance claim for me made this my best dental experience yet! Would highly recommend.",
        "title": "State of the art facility with a welcoming atmosphere."
      },
      {
        "authorLastName": "M",
        "createdDate": {
          "month": 2,
          "year": 2015,
          "day": 22
        },
        "authorFirstName": "Rozina",
        "rating": 5,
        "id": 1119377,
        "text": "I was very happy with my treatment. I had fillings done for 3 of my teeth. I was well informed of my treatment and was walked through my xrays to show me the  areas needing attention and treatment plans. ",
        "title": "Very professional"
      }
    ],
    "stats": {
      "averageRating": 5,
      "recommendationRate": 100,
      "count": 16
    }
  }